"STORE_DESCRIPTION" = "VLC merupakan sebuah pemain multimedia silang-platform bersumber-terbuka.\nIa boleh memainkan semua jenis filem, rancangan dan muzik dalam pelbagai format secara terus tanpa membuat penukaran format.\nIa membenarkan penyegerakkan fail dengan Dropbox, GDrive, OneDrive, Box, iCloud Drive, iTunes, muat turun terus melalui perkongsian Wi-Fi selain penstriman daripada pelayan media SMB, FTP, UPnP/DLNA dan sesawang. \nVLC menawarkan sokongan untuk sari kata lanjutan termasuk keserasian penuh SSA, audio berbilang-trek, kawalan kelajuan main balik dan pengemasgabungan melalui Chromecast.";

"STORE_DESCRIPTION_TV" = "VLC adalah pemain multimedia platform-silang bersumber terbuka dan ianya percuma.\nIa dapat memainkan semua filem, rancangan TV dan muzik anda dalam kebanyakan format secara terus tanpa penukaran format.\nIa membolehkan Main Balik Jauh melalui Mac atau PC anda melalui UI Sesawang serta penstriman menerusi pelayan media UPnP, SMB, FTP dan sesawang.\n\nVLC sepenuhnya percuma dan bersumber terbuka.\n\nKerja seni disediakan oleh TMDb, yang menyelenggara pangkalan data filem oleh komuniti.";

"UNKNOWN_TRACK_TYPE" = "Jenis trek tidak diketahui";
"CHOOSE_TITLE" = "Pilih Tajuk";
"CHOOSE_CHAPTER" = "Pilih Bab";
"CHAPTER_SELECTION_TITLE" = "Bab";
"TITLE" = "Tajuk";
"CHAPTER" = "Bab";
"TRACK_SELECTION" = "Pemilihan Trek";
"AUDIO" = "Audio";
"SUBTITLES" = "Sari kata";
"LANGUAGE" = "Bahasa";
"MEDIA_INFO" = "Maklumat Media";
"VIDEO_DIMENSIONS" = "Dimensi video";
"FORMAT_VIDEO_DIMENSIONS" = "%ix%i piksel";
"FORMAT_AUDIO_TRACKS" = "%i trek audio";
"ONE_AUDIO_TRACK" = "Satu trek audio";
"FORMAT_SPU_TRACKS" = "%i trek sari kata";
"ONE_SPU_TRACK" = "Satu trek sari kata";
"TRACKS" = "%i Trek";
"TRACK" = "%i Trek";
"TRACKS_DURATION" = "%u trek, tempoh: %@";
"NB_ALBUM_FORMAT" = "%i Album";
"NB_ALBUMS_FORMAT" = "%i Album";

"PLAYING_EXTERNALLY_TITLE" = "TV Bersambung";
"PLAYING_EXTERNALLY_DESC" = "Video ini dimainkan di TV";
"PLAYING_EXTERNALLY_ADDITION" = "\nKini dimainkan pada:"; /* \n should stay in every translation */

"VFILTER_HUE" = "Rona";
"VFILTER_CONTRAST" = "Beza Jelas";
"VFILTER_BRIGHTNESS" = "Kecerahan";
"VFILTER_SATURATION" = "Ketepuan";
"VFILTER_GAMMA" = "Gama";

"PRESET_PREAMP_SETTING" = "Tetapan praset / praamp";
"PREAMP" = "Praamp";
"SNAP_BANDS" = "Lekap jalur";

"PLAYBACK_FAILED" = "Main balik gagal";
"PLEASE_WAIT" = "Tunggu sebentar";
"AR_CHANGED" = "Nisbah Bidang: %@";
"DEFAULT" = "Lalai";
"FILL_TO_SCREEN" = "Kerat untuk mengisi skrin";
"PLAYBACK_SPEED" = "Kelajuan main balik";
"SPU_DELAY" = "Lengah sari kata";
"AUDIO_DELAY" = "Lengah audio";
"BUTTON_SLEEP_TIMER" = "Pemasa Tidur";
"SLEEP_TIMER_UPDATED" = "Pemasa Tidur Dikemas Kini";
"CONTINUE_PLAYBACK" = "Teruskan main balik?";
"CONTINUE_PLAYBACK_LONG" = "Anda mahu teruskan main balik \"%@\" pada lokasi terakhir anda tinggalkan?";

"BUTTON_ABOUT" = "Perihal";
"BUTTON_BACK" = "Undur";
"BUTTON_DONE" = "Selesai";
"BUTTON_CANCEL" = "Batal";
"BUTTON_SAVE" = "Simpan";
"BUTTON_DOWNLOAD" = "Muat turun";
"BUTTON_DELETE" = "Padam";
"BUTTON_OK" = "OK";
"BUTTON_DISMISS" = "Keluar";
"BUTTON_CONTACT" = "Hubungi kami";
"BUTTON_CONNECT" = "Sambung";
"BUTTON_RENAME" = "Nama Semula";
"BUTTON_LEARN_MORE" = "Ketahui Lagi";
"BUTTON_LOGOUT" = "Daftar Keluar";
"BUTTON_CONTINUE" = "Teruskan";
"BUTTON_SET" = "Tetap";
"BUTTON_RESET" = "Tetap Semula";
"BUTTON_RESCAN" = "Imbas Semula";
"PRIVATE_PLAYBACK_TOGGLE" = "Main Balik Persendirian";
"SCAN_SUBTITLE_TOGGLE" = "Imbas untuk Sari Kata (http-sahaja)";

"BUTTON_RENDERER" = "Peranti penyiaran";
"BUTTON_RENDERER_HINT" = "Tunjuk menu peranti penyiaran yang ada";
"BUTTON_AIRPLAY" = "AirPlay atau Bluetooth";
"BUTTON_AIRPLAY_HINT" = "Tunjuk menu peranti AirPlay atau Bluetooth yang ada";

"UPGRADING_LIBRARY" = "Menatar Pustaka Media";

"FAVORITES" = "Kegemaran";
"NO_FAVORITES" = "Belum ada kegemaran lagi";
"NO_FAVORITES_DESCRIPTION" = "Tanda folder kegemaran anda ketika melayari pelayan supaya ia tersenarai di sini.";
"ADD_FAVORITE" = "Tambah ke Kegemaran";
"REMOVE_FAVORITE" = "Buang daripada Kegemaran";
"FAVORITE_ALERT_TITLE" = "Adakah anda mahu menambah folder ini ke dalam Kegemaran anda?";
"UNFAVORITE_ALERT_TITLE" = "Adakah anda mahu membuang folder ini daripada Kegemaran anda?";

"OPEN_NETWORK" = "Buka Strim Rangkaian";
"NETWORK_TITLE" = "Strim Rangkaian";
"OPEN_NETWORK_HELP" = "Masukkan mana-mana alamat HTTP, RTSP, RTMP, MMS, FTP atau UDP/RTP untuk membuka strim secara langsung.";
"HTTP_UPLOAD_SERVER_OFF" = "Pelayan Tidak Aktif";
"HTTP_UPLOAD_NO_CONNECTIVITY" = "Tiada sambungan Wi-Fi aktif";
"OPEN_STREAM_OR_DOWNLOAD" = "Anda mahu memuat turun atau memainkan URL ini?";
"ALWAYS_STREAM_URL" = "Sentiasa main URL";
"SHARED_VLC_IOS_LIBRARY" = "VLC Terkongsi untuk Pustaka iOS";
"SMB_CIFS_FILE_SERVERS" = "Pelayan Fail (SMB)";

"MANAGED_SERVERS" = "Diurus";

"SMB_CIFS_FILE_SERVERS_SHORT" = "SMB";

"HTTP_DOWNLOAD_CANCELLED" = "Muat turun dibatal oleh pengguna";

"DOWNLOAD_FROM_HTTP" = "Muat turun";
"ERROR_NUMBER" = "Ralat %i berlaku";
"DOWNLOAD_FAILED" = "Muat turun gagal";
"FILE_NOT_SUPPORTED" = "Format fail tidak disokong";
"FILE_NOT_SUPPORTED_LONG" = "Format fail yang diguna oleh %@ tidak disokong oleh versi VLC ini untuk iOS.";
"SCHEME_NOT_SUPPORTED" = "Skema alamat tidak disokong";
"SCHEME_NOT_SUPPORTED_LONG" = "Skema alamat (%@) tidak disokong. Sila guna alamat bermula dengan HTTP, HTTPS atau FTP.";
"RENAME_MEDIA_TO" = "Masukkan nama untuk %@";

"FOLDER_EMPTY" = "Folder kosong";

"SHARING_ACTION_SHEET_TITLE_CHOOSE_FILE" = "Pilih satu fail untuk dibuka:";
"SHARING_ACTIVITY_OPEN_IN_TITLE" = "Buka Dalam...";
"SHARING_ERROR_NO_FILES" = "Tidak dapat cari mana-mana fail untuk dikongsi";
"SHARING_ERROR_NO_APPLICATIONS" = "Tidak dapat cari mana-mana aplikasi untuk membuka jenis fail ini";
"SHARING_SUCCESS_CAMERA_ROLL" = "Fail berjaya disimpan ke Camera Roll";

"FAVORITEVC_DETAILTEXT" = "Lihat folder kegemaran anda";
"STREAMVC_DETAILTEXT" = "Main strim secara terus tanpa memuat turun";
"DOWNLOADVC_DETAILTEXT" = "Muat turun fail terus ke dalam peranti anda";
"HEADER_TITLE_RENDERER" = "Pilih satu peranti penyiaran";

"BROWSE" = "Layar";
"NETWORK" = "Rangkaian";
"LOCAL_NETWORK" = "Rangkaian Setempat";
"CONNECT_TO_SERVER" = "Sambung ke Pelayan";
"FILE_SERVER" = "Pelayan Fail";
"USER_LABEL" = "Pengguna";
"PASSWORD_LABEL" = "Kata Laluan";
"DISABLE_LABEL" = "Dilumpuhkan";
"BUTTON_ANONYMOUS_LOGIN" = "Daftar Masuk Awanama";

"LOCAL_SERVER_REFRESH" = "Segar Semula";
"LOCAL_SERVER_LAST_UPDATE" = "Terakhir Dikemas kini pada %@";
"LOCAL_SERVER_CONNECTION_FAILED_TITLE" = "SAMBUNGAN PELAYAN GAGAL";
"LOCAL_SERVER_CONNECTION_FAILED_MESSAGE" = "Sila semak alamat pelayan dan kelayakan anda";

"FILES_APP_CELL_TITLE" = "Fail setempat";
"FILES_APP_CELL_SUBTITLE" = "Buka satu fail tanpa menyalinnya ke dalam VLC";

"CLOUD_SERVICES" = "Perkhidmatan Awan";
"LOGIN" = "Daftar Masuk";
"LOGGED_IN" = "Didaftar masuk";
"LOGGED_IN_SERVICES" = "%d mendaftar masuk ke perkhidmatan";
"LOGGED_IN_SERVICE" = "1 mendaftar masuk ke perkhidmatan";

"DROPBOX_DOWNLOAD" = "Muat turun fail?";
"DROPBOX_DL_LONG" = "Anda mahu muat turun \"%@\" ke %@ anda?";
"DROPBOX_LOGIN" = "Daftar Masuk";

"GDRIVE_ERROR_FETCHING_FILES" = "Ralat semasa mendapatkan fail";
"GDRIVE_DOWNLOAD_SUCCESSFUL" = "Fail anda berjaya dimuat turun";
"GDRIVE_DOWNLOAD_SUCCESSFUL_TITLE" = "BERJAYA";
"GDRIVE_ERROR_DOWNLOADING_FILE" = "Satu ralat berlaku ketika memuat turun";
"GDRIVE_ERROR_DOWNLOADING_FILE_TITLE" = "RALAT";

"ONEDRIVE_MEDIA_WITHOUT_URL" = "Media terpilih tidak mempunyai url boleh main";

"DISK_FULL" = "Had storan dicapai";
"DISK_FULL_FORMAT" = "%@ tidak dapat disimpan dalam %@ anda, kerana anda tidak mempunyai ruang bebas yang mencukupi.";

"NUM_OF_FILES" = "%i fail";
"ONE_FILE" = "1 fail";
"NO_FILES" = "Tiada fail disokong";
"DOWNLOADING" = "Memuat turun...";
"REMAINING_TIME" = "Masa berbaki: %@";
"BIOMETRIC_UNLOCK" = "Buka Pustaka Media\nBatal untuk masukkan Kod Laluan";

// Passcode Strings that we need to localize for them
"Set Passcode" = "Tetapkan Kod Laluan";
"Enter Passcode" = "Masukkan Kod Laluan";
"Enter a passcode" = "Masukkan satu kod laluan";
"Enter your passcode" = "Masukkan kod laluan anda";
"Passcodes did not match. Try again." = "Kod laluan tidak sepadan. Cuba lagi.";
"Re-enter your passcode" = "Masukkan semula kod laluan anda";
"Passcode Options" = "Pilihan Kod Laluan";
"4-Digit Numeric Code" = "Kod Angka 4-Digit"; /* Passcode 4 digit numeric code */
"6-Digit Numeric Code" = "Kod Angka 6-Digit"; /* Passcode 6 digit numeric code */

"Settings" = "Tetapan"; // plain text key to keep compatibility with InAppSettingsKit's upstream
"ON" = "Hidup";
"OFF" = "Mati";

"EMPTY_LIBRARY" = "Pustaka Media Kosong";
"EMPTY_LIBRARY_LONG" = "Untuk main balik, anda boleh strimkan media melalui pelayan pada rangkaian tempatan anda, daripada awan atau menyegerak media ke peranti anda menggunakan perkhidmatan iTunes,  Muat Naik Wi-Fi atau Awan.";

"EMPTY_NO_PLAYLISTS" = "Senarai Main";
"EMPTY_NO_PLAYLISTS_DESCRIPTION" = "Untuk mencipta senarai main, masuk mod Sunting dalam tab kandungan Video atau Audio dan kemudian pilih media kegemaran anda.\nAnda juga boleh menyegerak senarai main sedia ada melalui peranti lain anda atau internet.";

"EMPTY_PLAYLIST" = "Senarai main kosong";
"EMPTY_PLAYLIST_DESCRIPTION" = "Tambah media ketika menyunting dalam kategori masing-masing.";

"EMPTY_HISTORY" = "Kosongkan Sejarah";
"EMPTY_HISTORY_DESCRIPTION" = "Belum ada media.";

"EMPTY_MEDIA_LIST" = "Senarai Media Kosong";
"EMPTY_MEDIA_LIST_DESCRIPTION" = "Senarai media kosong, oleh itu main balik tidak dapat dimulakan";

"PLAYBACK_SCRUB_HELP" = "Seret jari anda mengarah ke atas untuk melaras kadar scrubbing.";
"PLAYBACK_SCRUB_HIGH" = "Penggerakan Berkelajuan-Tinggi";
"PLAYBACK_SCRUB_HALF" = "Penggerakan Berkelajuan-Separa";
"PLAYBACK_SCRUB_QUARTER" = "Penggerakan Berkelajuan-Suku";
"PLAYBACK_SCRUB_FINE" = "Penggerakan Halus";
"PLAYBACK_SCRUB_TOTAL_TIME_FORMAT" = "%@ berbaki, jumlah tempoh masa %@"; /* 1: elapsed time, 2: total time */
"PLAYBACK_SCRUB_REMAINING_TIME_FORMAT" = "%@ berbaki, %@"; /* 1: elapsed time, 2: remaining time */
"PLAYBACK_SCRUB_ACCESSIBILITY_TIME_DISPLAY" = "Paparan Masa";
"PLAYBACK_POSITION" = "Kedudukan Main Balik";
"VIDEO_FILTER" = "Penapis Video";
"VIDEO_FILTER_RESET_BUTTON" = "Tetap Semula Penapis Video";
"VIDEO_ASPECT_RATIO_BUTTON" = "Nisbah bidang video";
"BWD_BUTTON" = "Lompat Mengundur";
"FWD_BUTTON" = "Lompat Maju";
"PLAY_BUTTON" = "Main";
"NEXT_BUTTON" = "Berikutnya";
"PREV_BUTTON" = "Terdahulu";
"PLAY_ALL_BUTTON" = "Main semua";
"PLAY_ALL_HINT" = "Main semua media di dalam koleksi";

"RESET_VIDEO_FILTERS" = "Anda pasti mahu menetap semula penapis video?";
"RESET_PLAYBACK_SPEED" = "Anda pasti mahu menetap semula kelajuan main balik?";
"RESET_EQUALIZER" = "Anda pasti mahu menetap semula tetapan penyama?";
"RESET_SLEEP_TIMER" = "Anda pasti mahu menetap semula pemasa tidur?";

"CUSTOM_EQUALIZER_PROFILES" = "Profil Suai";
"DEFAULT_PROFILE_NAME" = "Profil suai";
"CUSTOM_EQUALIZER_ALERT_TITLE" = "Simpan profil baharu";
"CUSTOM_EQUALIZER_ALERT_MESSAGE" = "Anda pasti mahu menyimpan profil baharu dengan nilai tersebut?";
"RENAME_CUSTOM_PROFILE_TITLE" = "Nama semula profil";
"DELETE_CUSTOM_PROFILE_TITLE" = "Padam profil";
"DELETE_CUSTOM_PROFILE_MESSAGE" = "Anda pasti mahu memadam profil tersebut?";

"VERSION_FORMAT" = "Versi: %@";
"BASED_ON_FORMAT" = "Berdasarkan pada:<br />%@";

"NEW" = "BAHARU";

"VO_VIDEOPLAYER_TITLE" = "Pemain Video";
"VO_VIDEOPLAYER_DOUBLETAP" = "Ketik dua kali untuk tunjuk atau sembunyikan kawalan main balik";

"FIRST_STEPS_ITUNES" = "Segerak Fail";
"FIRST_STEPS_ITUNES_TITLE" = "Segerak Dengan Komputer Anda";
"FIRST_STEPS_ITUNES_DETAILS" = "Sambung %@ untuk guna Finder atau iTunes untuk \"Perkongsian Fail\". Pilih VLC untuk memindahkan fail.";
"FIRST_STEPS_WIFI_TITLE" = "Kongsi melalui Wi-Fi";
"FIRST_STEPS_WIFI_DETAILS" = "Masukkan URL terjana dalam pelayar sesawang kegemaran anda semasa bersambung dengan rangkaian yang sama sebagai %@ anda.";
"FIRST_STEPS_CLOUDS" = "Awan";
"FIRST_STEPS_CLOUD_TITLE" = "Awan";
"FIRST_STEPS_CLOUD_DETAILS" = "Muat naik media anda ke perkhidmatan awan seperti Google Drive atau Dropbox untuk memuat turun atau strimkannya secara jauh.";

"PLEX_CHECK_ACCOUNT" = "Semak akaun Plex anda di dalam tetapan";
"PLEX_ERROR_ACCOUNT" = "Ralat daftar masuk Plex";

"UNAUTHORIZED" = "Tidak disahihkan";

"SERVER" = "Pelayan";
"SERVER_PORT" = "Port";
"NO_SERVER_FOUND" = "Tiada pelayan ditemui";
"NO_RECENT_STREAMS" = "Tiada strim telah dimainkan baru-baru ini";

"WEBINTF_TITLE" = "Berkongsi melalui Wi-Fi";
"WEBINTF_ETHERNET" = "Perkongsian melalui Ethernet";
"WEBINTF_DROPFILES" = "Lepas Fail";
"WEBINTF_DROPFILES_LONG" = "Lepas fail ke tetingkap untuk menambahnya ke dalam %@ anda.<br>Atau klik pada butang \"+\" untuk guna dialog pengambil fail.";
"WEBINTF_DOWNLOADFILES" = "Muat Turun Fail";
"WEBINTF_DOWNLOADFILES_LONG" = "Hanya klik fail yang anda mahu muat turun dari %@ anda.";
"WEBINTF_ADDRESS_COPIED" = "Alamat disalin ke papan keratan";
"WEBINTF_TITLE_ATV" = "Main Balik Jauh";
"WEBINTF_DROPFILES_LONG_ATV" = "Lepas fail dalam tetingkap untuk menambah %@ anda.<br>Atau klik pada butang \"+\" untuk guna dialog pengambil fail.";
"WEBINTF_URL_SENT" = "Penghantaran URL berjaya.";
"WEBINTF_URL_EMPTY" = "URL tidak boleh kosong.";
"WEBINTF_URL_INVALID" = "Bukan URL yang sah.";
"WEBINTF_AUTH_REQUIRED" = "Sila masukkan kod laluan yang anda telah tetapkan dalam VLC iOS:";
"WEBINTF_AUTH_WRONG_PASSCODE" = "Kod laluan salah. <br> Percubaan berbaki:";
"WEBINTF_AUTH_BANNED" = "Anda telah memasukkan terlalu banyak kod laluan yang salah. <br>Sila mula semula VLC iOS dan cuba lagi sekali.";

"DURATION" = "Tempoh";
"TITLE" = "Tajuk";
"ROTATE_BUTTON" = "Putar"; /* Accessibility label for rotate button on the player */
"ROTATE_BUTTON_HINT" = "Togol pemain video antara mod lanskap dan potret."; /* Accessibility hint for rotate button on the player */

"AUDIO_INFO_VC_TITLE" = "Maklumat Audio";
"ENTER_URL" = "Masukkan URL untuk main";
"HTTP_SERVER_ON" = "Lumpuhkan Main Balik Jauh";
"HTTP_SERVER_OFF" = "Dayakan Main Balik Jauh";
"CACHED_MEDIA" = "Media Bercache";
"CACHED_MEDIA_LONG" = "Media yang ditunjukkan di sini tersimpan secara setempat dalam TV Apple anda. Perhatian kandungan boleh dibuang oleh sistem pengoperasian tanpa makluman bila VLC tidak berjalan jika peranti anda kekurangan storan.";
"DOWNLOAD_SUBS_FROM_OSO" = "Muat Turun Sari Kata...";
"FOUND_SUBS" = "Temui sari kata";
"NO_SUB_FOUND_OSO" = "Tiada sari kata ditemui untuk item media \"%@\" anda.";
"SELECT_AUDIO_FROM_FILES" = "Muat Audio Luar...";
"SELECT_SUBTITLE_FROM_FILES" = "Muat Sari Kata Luar...";
"USE_SPDIF" = "Guna Pass-through (S/PDIF)";

"PLAYBACK" = "Main Balik";
"REPEAT_MODE" = "Ulang";
"REPEAT_DISABLED" = "Dilumpuhkan";
"REPEAT_SINGLE" = "Tunggal";
"REPEAT_FOLDER" = "Folder";
"SHUFFLE" = "Kocok";
"SHUFFLE_DISABLED" = "Kocok mati";

"RESET_NETWORK_STREAM_LIST_TITLE" = "Tetap semula senarai";
"RESET_NETWORK_STREAM_LIST_TEXT" = "Tetap semula senarai strim rangkaian dimainkan baru-baru ini secara kekal.";

// MARK: - Local Network Service Names
"UPNP_LONG" = "Plug'n'Play Universal (UPnP)";
"UPNP_SHORT" = "UPnP";

"PLEX_LONG" = "Pelayan Meida Plex (melalui Bonjour)";
"PLEX_SHORT" = "Plex";

"FTP_SHORT" = "FTP";
"SFTP_SHORT" = "SFTP";

"NFS_LONG" = "Sistem Fail Rangkaian (NFS)";
"NFS_SHORT" = "NFS";

"BONJOUR_FILE_SERVERS" = "Pelayang Fail BONJOUR";
"DSM_WORKGROUP" = "Kumpulan Kerja";

"URL_NOT_SUPPORTED" = "URL tidak dapat dibuka";

// Insert %@ where play-pause-glyph should be placed
"DELETE_ITEM_HINT" = "Tekan %@ untuk Padam"; /* Insert %@ where play-pause-glyph should be placed */
"DELETE_MESSAGE" = "Sahkan pemadaman pemilihan";
"DELETE_MESSAGE_PLAYLIST" = "Anda pasti mahu memadam senarai main terpilh?\nFail media berkaitan tidak dipadamkan.";
"DELETE_MESSAGE_PLAYLIST_CONTENT" = "Anda pasti mahu membuang media dari senarai main?\nIa tidak dipadamkan daripada cakera.";

// MARK: - Drag and Drop

"PROTOCOL_NOT_SELECTED" = "Protokol tidak terpilih";
"Settings" = "Tetapan";

"ERROR" = "Ralat";
"SORT" = "Isih";
"SORT_BY" = "Isih mengikut";
"SEARCH" = "Gelintar";
"VIDEO" = "Video";

// MARK: - MediaViewController Swipable Header
"ALBUMS" = "Album";
"ARTISTS" = "Artis";
"EPISODES" = "Episod";
"GENRES" = "Genre";
"ALL_VIDEOS" = "Semua video";
"SONGS" = "Lagu";
"PLAYLISTS" = "Senarai Main";
"VIDEO_GROUPS" = "Kumpulan video";
"HISTORY" = "Sejarah";
"MODIFIED_DATE" = "Tarikh ubah suai";
"NAME" = "Nama";

// MARK: - EDIT

"BUTTON_MENU" = "Menu";
"BUTTON_MENU_HINT" = "Pilih, tertib semula dan isih item-item media yang ada dalam pandangan ini";

"BUTTON_EDIT" = "Sunting";
"BUTTON_EDIT_HINT" = "Mod sunting";

"BUTTON_SELECT" = "Pilih";
"BUTTON_SELECT_HINT" = "Pilih butang";

"BUTTON_SELECT_ALL" = "Pilih semua";
"BUTTON_SELECT_ALL_HINT" = "Pilih semua item media yang hadir dalam pandangan ini";

"BUTTON_HISTORY" = "Sejarah";
"BUTTON_HISTORY_HINT" = "Lihat media anda yang dimainkan baru-baru ini";

"BUTTON_CLEAR" = "Kosongkan";
"CLEAR_HISTORY_TITLE" = "Kosongkan Sejarah";
"CLEAR_HISTORY_MESSAGE" = "Sahkan pengosongan sejarah";

"ADD_TO_PLAYLIST" = "Tambah ke dalam Senarai Main";
"ADD_TO_PLAYLIST_HINT" = "Buka untuk tambah ke dalam menu senarai main";

"PLAY_AS_AUDIO" = "Main sebagai audio";
"PLAY_AS_AUDIO_HINT" = "Main fail video sebagai fail audio.";

"PLAYLIST_PLACEHOLDER" = "Tajuk senarai nama";
"PLAYLIST_DESCRIPTION" = "Pilih satu tajuk untuk senarai main baharu anda";
"PLAYLIST_CREATION" = "Cipta satu senarai main baharu";
"PLAYLIST_CREATION_HINT" = "Tunjuk satu tindakan interaktif untuk mencipta satu senarai main";
"ERROR_PLAYLIST_CREATION" = "Gagal mencipta satu senarai main";
"ERROR_PLAYLIST_TRACKS" = "Gagal memperoleh trek";

"ERROR_RENAME_FAILED" = "Penamaan semula gagal";
"ERROR_EMPTY_NAME" = "Tajuk tidak boleh kosong";

"SHARE_LABEL" = "Kongsi";
"SHARE_HINT" = "Kongsi fail terpilih";
"RENAME_HINT" = "Namakan semula fail terpilih";
"DELETE_HINT" = "Padam fail terpilih";

"ADDITIONAL_OPTIONS" = "Pilihan tambahan";

// MARK: - Sort

"BUTTON_SORT" = "Isih";
"BUTTON_SORT_HINT" = "Papar lembar tindakan isih";
"HEADER_TITLE_SORT" = "Isih mengikut";
"DESCENDING_LABEL" = "Tertib Menurun";
"DESCENDING_SWITCH_LABEL" = "Tertib menaik atau menurun";
"DESCENDING_SWITCH_HINT" = "Isih konteks dalam tertib menaik atau menurun";
"GRID_LAYOUT" = "Grid";
"GRID_LAYOUT_HINT" = "Papar item sebagai grid";
"LIST_LAYOUT" = "Senarai";
"HIDE_FEAT_ARTISTS" = "Sembunyi artis bersama";
"HIDE_TRACK_NUMBERS" = "Sembunyi nombor trek";

// MARK: - VLCMediaLibraryKit - Sorting Criteria

"ALPHA" = "secara Abjad Angka";
"DURATION" = "Tempoh";
"INSERTION_DATE" = "Tarikh disisip";
"LAST_MODIFICATION_DATE" = "Tarikh pengubahsuaian terakhir";
"RELEASE_DATE" = "Tarikh pelepasan";
"FILE_SIZE" = "Saiz fail";
"ARTIST" = "Artis";
"PLAY_COUNT" = "Kiraan main";
"ALBUM" = "Album";
"FILENAME" = "Nama fail";
"TRACK_NUMBER" = "Nombor trek";
"NB_AUDIO" = "Bilangan audio";
"NB_MEDIA" = "Bilangan media";
"NB_VIDEO" = "Bilangan video";
"NB_ALBUM" = "Bilangan album";
"LAST_PLAYBACK_DATE" = "Tarikh main balik terakhir";
"TRACK_ID" = "ID Trek";
"CUSTOM" = "Custom";

// MARK: - VLCNetworkLoginTVViewController

"NO_SAVING_DATA" = "Tiada apa-apa ditemui";

// MARK: - MediaCollectionViewCell

"UNKNOWN_ARTIST" = "Artis Tidak Diketahui";
"VARIOUS_ARTIST" = "Pelbagai Artis";
"UNKNOWN_ALBUM" = "Album Tidak Diketahui";
"SINGLE_ITEM_SELECTED" = "item dipilih";
"MULTIPLE_ITEMS_SELECTED" = "item dipilih";

// MARK: - VideoPlayerControls

"SUBTITLE_AND_TRACK_BUTTON" = "Trek sari kata dan audio";
"SUBTITLE_AND_TRACK_HINT" = "Pilih trek sari kata atau audio";

"DVD_BUTTON" = "DVD";
"DVD_HINT" = "Antara muka DVD";

"ROTATION_LOCK_BUTTON" = "Kunci putaran";
"ROTATION_LOCK_HINT" = "Kunci video kekal mengikut orientasi semasa";

"REPEAT_HINT" = "Ulang media yang sama";
"DO_NOT_REPEAT_HINT" = "Jangan ulang senarai media";
"REPEAT_ALL_HINT" = "Ulang senarai media";

"BACKWARD_BUTTON" = "Undur";
"BACKWARD_HINT" = "Lompat Mengundur";

"PREVIOUS_BUTTON" = "Terdahulu";
"PREVIOUS_HINT" = "Media terdahulu";

"PLAY_PAUSE_BUTTON" = "Main atau jeda";
"PLAY_PAUSE_HINT" = "Main atau jeda main balik semasa";

"STOP_BUTTON" = "Henti";
"CLOSE_HINT" = "Henti main balik";

"MINIMIZE_BUTTON" = "Minimum";
"MINIMIZE_HINT" = "Kecilkan pemain";

"NEXT_HINT" = "Media berikutnya";

"FORWARD_BUTTON" = "Maju";
"FORWARD_HINT" = "Lompat Maju";

"INTERFACE_LOCK_BUTTON" = "Kunci antara muka";

"SELECT_A_MARK" = "Pilih tanda A";
"SELECT_A_MARK_HINT" = "Pilih tanda A dari gelung AB";
"SELECT_B_MARK" = "Pilih tanda B";
"SELECT_B_MARK_HINT" = "Pilih tanda B dari gelung AB";

"AB_LOOP" = "Gelung A→B";
"AB_LOOP_MARKS" = "Tanda Gelung A→B";

"RESET_AB_LOOP" = "Anda pasti mahu buang gelung A→B?";
"RESET_AB_LOOP_MARKS" = "Anda pasti mahu meneta semula penanda gelung A→B?";

"SHUFFLE_HINT" = "Kocok senarai media";
"SHUFFLE_OFF_HINT" = "Jangan kocok senarai media";

"ASPECT_RATIO_TITLE" = "Nisbah Bidang";
"VIDEO_ASPECT_RATIO_BUTTON" = "Nisbah bidang video";
"VIDEO_ASPECT_RATIO_HINT" = "Ubah nisbah bidang video semasa";

"MORE_OPTIONS_BUTTON" = "Lagi";
"MORE_OPTIONS_HINT" = "Lihat lebih banyak kawalan pilihan";

"PLAYBACK_CONTROLS_BAR_TITLE" = "Kawalan main balik";
"PLAYBACK_CONTROLS_BAR_HINT" = "Jeda, jangkau, bab berikutnya";

"PLAYER_WARNING_SUBTITLE_CAST_TITLE" = "Sari kata tidak disokong";
"PLAYER_WARNING_SUBTITLE_CAST_DESCRIPTION" = "Sari kata belum disokong semasa penyiaran.";

// MARK: - MediaMoreOptionsActionSheet
"EQUALIZER_CELL_TITLE" = "Penyama";
"MORE_OPTIONS_HEADER_TITLE" = "Pilihan Video";
"MORE_OPTIONS_HEADER_AUDIO_TITLE" = "Pilihan Audio";
"BOOKMARKS_TITLE" = "Tanda buku";
"ADD_BOOKMARKS_TITLE" = "Tambah Tanda Buku";
"BOOKMARK_DEFAULT_NAME" = "Tanda buku di";
"BOOKMARK_RENAME_TITLE" = "Nama semula tanda buku";
"BOOKMARK_DELETE_TITLE" = "Padam tanda buku";
"BOOKMARK_DELETE_MESSAGE" = "Sahkan pemadaman tanda buku";
"INCREASE_BUTTON" = "Butang tambah";
"INCREASE_PLAYBACK_SPEED" = "Tambah kelajuan main balik";
"INCREASE_AUDIO_DELAY" = "Tambah lengah audio";
"INCREASE_SUBTITLES_DELAY" = "Tambah lengah sari kata";
"DECREASE_BUTTON" = "Butang kurang";
"DECREASE_PLAYBACK_SPEED" = "Kurangkan kelajuan main balik";
"DECREASE_AUDIO_DELAY" = "Kurangkan lengah audio";
"DECREASE_SUBTITLES_DELAY" = "Kurangkan lengah sari kata";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT" = "Tunjuk pintasan kelajuan main balik";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT_HINT" = "Dayakan paparan pintasan kelajuan main balik";
"VIDEO_FILTERS_HINT" = "Pilih untuk buka pandangan penapis video";
"PLAYBACK_SPEED_HINT" = "Pilih untuk buka pandangan kelajuan main balik";
"SUBTITLES_DELAY_HINT" = "Pilih untuk buka pandangan lengah sari kata";
"AUDIO_DELAY_HINT" = "Pilih untuk buka pandangan lengah audio";
"SLEEP_TIMER_HINT" = "Pilih untuk buka pandangan pemasa tidur";
"EQUALIZER_HINT" = "Pilih untuk buka pandangan penyama";
"CHAPTERS_HINT" = "Pilih untuk buka pandangan bab";
"BOOKMARKS_HINT" = "Pilih untuk buka pandangan tanda buku";
"INTERFACE_LOCK_HINT" = "Dayakan pilihan untuk kunci antara muka pengguna";

// MARK: - Settings
"FORCE_RESCAN_TITLE" = "Paksa imbas semula pustaka media";
"FORCE_RESCAN_MESSAGE" = "Anda mahu paksa VLC mengimbas semula pustaka media anda?\nIa mengambil masa.";

"FEEDBACK_EMAIL_TITLE" = "Maklum balas berkenaan VLC di iOS dan iPad";
"FEEDBACK_EMAIL_NOT_POSSIBLE_TITLE" = "Akaun mel tidak dikonfigur";
"FEEDBACK_EMAIL_NOT_POSSIBLE_LONG" = "Hubungi kami melalui %@ dengan peranti lain.";

"SETTINGS_THEME_BLACK" = "Guna latar belakang hitam dalam mod gelap";
"SETTINGS_THEME_BLACK_SUBTITLE" = "Tambah baik hayat bateri bagi peranti berskrin OLED";

"SETTINGS_RESET_TITLE" = "Tetap semula tetapan";
"SETTINGS_RESET_MESSAGE" = "Anda pasti mahu menetap semula semua tetapan ke nilai lalainya?";

"SETTINGS_PLAY_ALL" = "Main balik lancar untuk koleksi";
"SETTINGS_PLAY_ALL_HINT" = "Dayakan main media berikutnya secara automatik dalam tab audio dan video";
"SETTINGS_PLAYLIST_PLAY_ALL" = "Main balik lancar untuk senarai main";
"SETTINGS_PLAYLIST_PLAY_ALL_HINT" = "Dayakan main media berikutnya secara automatik dalam tab senarai main";

"SETTINGS_DOCUMENTATION" = "Pendokumenan";

// MARK: - Local Network

"SMBV1_WARN_TITLE" = "Amaran Sambungan SMBv1";
"SMBV1_WARN_DESCRIPTION" = "Kami telah mengesan satu protokol lama (SMBv1).\nAnda pasti mahu teruskan penggunaan SMBv1?\nKami  sarankan menatar atau mengubah tetapan pelayan anda.";
"SMBV1_CONTINUE" = "Teruskan dengan SMBv1";
"SMBV1_NEXT_PROTOCOL" = "Cuba SMBv2/v3";

// MARK: - Preview labels

"ENCODING" = "Pengekodan";

// MARK: - Media groups

"ADD_TO_MEDIA_GROUP" = "Tambah ke kumpulan media";
"ADD_TO_MEDIA_GROUP_HINT" = "Buka untuk tambah ke dalam menu kumpulan media";

"MEDIA_GROUPS" = "Kumpulan media";
"MEDIA_GROUPS_DESCRIPTION" = "Pilih satu tajuk untuk kumpulan media baharu anda";
"MEDIA_GROUPS_PLACEHOLDER" = "Tajuk kumpulan media";

"REMOVE_FROM_MEDIA_GROUP" = "Buang dari kumpulan media";
"REMOVE_FROM_MEDIA_GROUP_HINT" = "Buang pemilihan daripada kumpulan media";

"MEDIA_GROUP_CREATION" = "Kumpulan media baharu";
"MEDIA_GROUP_CREATION_HINT" = "Tunjuk amaran ketika mencipta satu senarai main";
"MEDIA_GROUP_MOVE_TO_ROOT" = "Alih kandungan ke aras teratas";
"MEDIA_GROUP_MOVE_TO_ROOT_HINT" = "Alih kandungan pemilihan ke aras teratas";

"BUTTON_REGROUP" = "Kumpul Semula";
"BUTTON_REGROUP_TITLE" = "Kumpul semula pemilihan";
"BUTTON_REGROUP_HINT" = "Cuba kumpul semula media tunggal secara automatik.";
"BUTTON_REGROUP_DESCRIPTION" = "Anda pasti mahu cuba kumpul semula media tunggal secara automatik?\nTindakan ini mengambil sedikit masa.";

// MARK: - Files.app persistence file
"MEDIALIBRARY_FILES_PLACEHOLDER" = "Letak media di sini untuk menambahnya";
"MEDIALIBRARY_ADDING_PLACEHOLDER" = "Menambah...";

// MARK: - QueueViewController

"PLAY_HINT" = "Main";
"PLAY_LABEL" = "Main";
"PLAY_NEXT_IN_QUEUE_HINT" = "Main berikutnya dalam baris gilir";
"PLAY_NEXT_IN_QUEUE_LABEL" = "Main berikutnya dalam baris gilir";
"APPEND_TO_QUEUE_HINT" = "Tambah ke baris gilir";
"APPEND_TO_QUEUE_LABEL" = "Tambah ke baris gilir";
"QUEUE_LABEL" = "Baris Gilir";

"DISPLAY_AS" = "Papar sebagai";

/* New strings */
"BRIGHTNESS_HINT" = "Kawalan kecerahan menegak";
"BRIGHTNESS_SLIDER" = "Leret secara menegak untuk mengubah tahap kecerahan";

/* New strings */
"VOLUME_HINT" = "Kawalan volum menegak";
"VOLUME_SLIDER" = "Leret secara menegak untuk mengubah tahap volum";

// MARK: - AudioMiniPlayer playback controls menu
"MENU_PLAYBACK_CONTROLS" = "Kawalan main balik";
"MENU_REPEAT_DISABLED" = "Jangan ulang";
"MENU_REPEAT_SINGLE" = "Ulang sekali";
"MENU_REPEAT_ALL" = "Ulang semua";

// MARK: - ActionSheet

"ACTIONSHEET_BACKGROUND_LABEL" = "Latar belakang lembar tindakan";
"ACTIONSHEET_BACKGROUND_HINT" = "Ketik untuk buang lembar tindakan";

// MARK: - Donation
"DONATION_CUSTOM_AMOUNT" = "Masukkan Amaun Suai";
"DONATION_TITLE" = "Kerahsiaan mengatasi keuntungan";
"DONATION_DESCRIPTION" = "Multimedia sumber terbuka,  mementingkan kerahsiaan oleh anda. Tiada iklan, tiada penjejak, tiada kecurigaan. Percuma untuk semua orang. Derma sekarang untuk menyokong pembangunan VideoLAN.";
"DONATION_WINDOW_TITLE" = "Beri sumbangan untuk VideoLAN";
"DONATE_CC_DC" = "Kad Kredit atau Debit";
"DONATION_CHOOSE_PP" = "Sila pilih penyedia pembayaran anda";
"DONATION_CHOOSE_CURRENCY" = "Sila pilih matawang";
"DONATION_AMOUNT" = "Amaun sumbangan: %@";
"DONATION_CC_NUM" = "Nombor Kad Kredit";
"DONATION_CC_EXPIRY_DATE" = "Tarikh Luput";
"DONATION_CC_EXPIRY_DATE_MONTH" = "BB";
"DONATION_CC_EXPIRY_DATE_YEAR" = "TT";
"DONATION_CC_CVV" = "CVV";
"DONATION_APPLE_PAY_NOT_POSSIBLE" = "Gagal mengkonfigur Apple Pay";
"DONATION_APPLE_PAY_NOT_POSSIBLE_LONG" = "VLC gagal mengkonfigur Apple Pay untuk memberi sumbangan. Sila pilih penyedia pembayaran yang lain untuk teruskan.";
"DONATION_DONATE_BUTTON" = "Derma";
"PURCHASE_FAILED" = ".Pembayaran Gagal";
"SEND_DONATION" = "Hantar derma anda";
"PURCHASE_SUCESS_TITLE" = "Derma berjaya dihantar";
"PURCHASE_SUCESS_DESCRIPTION" = "Terima kasih atas derma anda!";
"DONATION_CONTINUE" = "Teruskan";
"BUTTON_NOT_NOW" = "Bukang sekarang";
"DONATION_NAGSCREEN_TITLE" = "Dermalah hari ini";
"DONATION_NAGSCREEN_SUBTITLE" = "Sokong multimedia bebas dan sumber terbuka";
"DONATION_INVOICES" = "Invois";
"DONATION_RECEIPTS" = "Resit";
"DONATION_INVOICES_RECEIPTS" = "Invois & Resit";
"DONATION_CHARGES_CLEARED_ON_REINSTALL" = "Jika anda telah memasang semula VLC, invois dan resit daripada derma dahulu tidak akan tersedia kerana semua maklumat peribadi anda hanya tersimpan dalam peranti ini.\n\nJika ada pertanyaan, hubungi kami di donation@videolan.org dan maklum berkenaan ID pengguna awanama ini: %@";
"DONATION_CANCEL_MONTHLY" = "Batal Derma Berkala";
"DONATION_MONTHLY" = "Bulanan";
"DONATION_MONTHLY_FORMAT" = "%@/bulan";
"DONATION_MONTHLY_VIDEOLAN" = "Derma secara Bulanan untuk VideoLAN";
"DONATION_ONCE" = "Sekali-Sahaja";
"DONATION_UPDATE_MONTHLY" = "Kemas Kini Derma Berkala";
"DONATION_VIDEOLAN" = "Derma buat VideoLAN";
"DONATION_CANCEL_LONG" = "Kami sedih kerana anda membatalkan derma bulanan anda untuk VideoLAN. Walaubagaimanapun sokongan terdahulu anda amat kami hargai. Terima kasih!";
"DONATION_BANK_TRANSFER" = "Pemindahan melalui Bank";
"DONATION_BANK_TRANSFER_LONG" = "Derma buat VideoLAN. VideoLAN tidak simpan atau kutip maklumat peribadi anda.";
"DONATION_BUTTON_AGREE" = "Setuju";
"DONATION_IBAN" = "Nombor Akaun Bank (IBAN)";
"DONATION_EMAIL" = "E-mel";
"DONATION_NAME" = "Nama";
"DONATION_NAME_BANK_ACCOUNT" = "Nama Akaun Bank";
"DONATION_EMBARGOED_COUNTRY" = "Buat masa ini kami tidak menerima derma daripada negara anda. Oleh itu nikmatlah VLC!";

// MARK: - Playback keyboard shortcuts

"KEY_JUMP_BACKWARDS" = "Lompat mengundur";
"KEY_JUMP_FORWARDS" = "Lompat maju";
"KEY_INCREASE_PLAYBACK_SPEED" = "Tingkatkan kelajuan main balik";
"KEY_DECREASE_PLAYBACK_SPEED" = "Kurangkan kelajuan main balik";
"KEY_RESET_PLAYBACK_SPEED" = "Tetap semula kelajuan main balik";
"KEY_SEEK_TO_PERCENT" = "Jangkau ke %i%% tempoh masa";

// MARK: - TitleSelection

"TITLESELECTION_BACKGROUND_LABEL" = "Latar belakang pemilihan tajuk";
"TITLESELECTION_BACKGROUND_HINT" = "Ketik untuk buang pandangan.";

// MARK: - NEW DELETE STRINGS
"DELETE_SINGLE_TITLE" = "Padam \"%@\"?";
"DELETE_MULTIPLE_TITLE" = "Padam \"%@\" dan %d yang lain?";

// MARK: - AppIntent Strings
"APPINTENT_PLAY_MEDIA_TITLE" = "Main di balik tabir";
"APPINTENT_PLAY_MEDIA_DESCRIPTION" = "Main senarai main terpilih di balik tabir tanpa membuka apl.";
"APPINTENT_PLAY_MEDIA_PLAY_${mediaName}" = "Main ${mediaName} di balik tabir";

// MARK: - VerticalSliderControl Strings
"VERTICAL_SLIDER_CONTROL_ACCESSIBILITY_LABEL" = "Pelungsur menegak";
"VERTICAL_SLIDER_CONTROL_INCREMENT_ACTION" = "Tambah";
"VERTICAL_SLIDER_CONTROL_DECREMENT_ACTION" = "Kurang";

// MARK: - Download Completion Announcement
"DOWNLOAD_COMPLETED_ANNOUNCEMENT" = "Fail \"%@\" selesai dimuat turun";

//MARK: - Playlist Add Action Status
"ADD_TO_PLAYLIST_STATUS_MESSAGE" = "Tambah media %d ke %@";
"ADD_ALERT_TITLE" = "Pemilihan ditemui dalam senarai main";
"ADD_ALERT_MESSAGE_SINGLE" = "Anda cuba menambah media yang sudah merupakan sebahagian daripada %@";
"ADD_ALERT_MESSAGE_MULTIPLE" = "Anda cuba menambah media %d yang sudah merupakan sebahagian daripada %@";

//MARK: - Last played playlist indicator
"LAST_PLAYED_PLAYLIST_LABEL_TITLE" = "Terakhir Main";
